#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.redis_messages.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-msgs-redis-01-private-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-msgs-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "io-p-itn-msgs-redis-01-private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-msgs-redis-01-private-service-connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis_messages.azurerm_redis_cache.this will be created
  + resource "azurerm_redis_cache" "this" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + minimum_tls_version           = "1.2"
      + name                          = "io-p-itn-msgs-redis-01"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "io-p-itn-msgs-rg-01"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + zones                         = [
          + "1",
          + "2",
        ]

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Monday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Tuesday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Wednesday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Thursday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = (known after apply)
          + maxmemory_delta                        = (known after apply)
          + maxmemory_policy                       = "volatile-lru"
          + maxmemory_reserved                     = (known after apply)
          + rdb_backup_enabled                     = false
        }
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "BACKEND_BASE_URL"                                = "https://io-p-app-appbackendli.azurewebsites.net"
          - "BACKEND_TOKEN"                                   = (sensitive value)
          - "COSMOSDB_NAME"                                   = "db"
          - "COSMOSDB_URI"                                    = "https://io-p-cosmos-api.documents.azure.com:443/"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "INTERNAL_USER_ID"                                = (sensitive value)
          - "MESSAGE_CONTAINER_NAME"                          = "message-content"
          - "MESSAGE_STORAGE_ACCOUNT_URI"                     = "https://iopstapi.blob.core.windows.net/"
          - "NODE_ENV"                                        = "production"
          - "NOTIFICATION_QUEUE_NAME"                         = "push-notifications"
          - "NOTIFICATION_STORAGE_ACCOUNT_URI"                = "https://iopweumessagesnotifst.queue.core.windows.net/"
          - "RC_CONFIGURATION_CACHE_TTL"                      = "28800"
          - "REDIS_PASSWORD"                                  = "dummy"
          - "REDIS_PORT"                                      = "dummy"
          - "REDIS_URL"                                       = "dummy"
          - "REMOTE_CONTENT_COSMOSDB_NAME"                    = "remote-content"
          - "REMOTE_CONTENT_COSMOSDB_URI"                     = "https://io-p-messages-remote-content.documents.azure.com:443/"
          - "SLOT_TASK_HUBNAME"                               = "ProductionTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "BACKEND_BASE_URL"                                = "https://io-p-app-appbackendli.azurewebsites.net"
          - "BACKEND_TOKEN"                                   = (sensitive value)
          - "COSMOSDB_NAME"                                   = "db"
          - "COSMOSDB_URI"                                    = "https://io-p-cosmos-api.documents.azure.com:443/"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "INTERNAL_USER_ID"                                = (sensitive value)
          - "MESSAGE_CONTAINER_NAME"                          = "message-content"
          - "MESSAGE_STORAGE_ACCOUNT_URI"                     = "https://iopstapi.blob.core.windows.net/"
          - "NODE_ENV"                                        = "production"
          - "NOTIFICATION_QUEUE_NAME"                         = "push-notifications"
          - "NOTIFICATION_STORAGE_ACCOUNT_URI"                = "https://iopweumessagesnotifst.queue.core.windows.net/"
          - "RC_CONFIGURATION_CACHE_TTL"                      = "28800"
          - "REDIS_PASSWORD"                                  = "dummy"
          - "REDIS_PORT"                                      = "dummy"
          - "REDIS_URL"                                       = "dummy"
          - "REMOTE_CONTENT_COSMOSDB_NAME"                    = "remote-content"
          - "REMOTE_CONTENT_COSMOSDB_URI"                     = "https://io-p-messages-remote-content.documents.azure.com:443/"
          - "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
